// Paramètres d'un Smart Trade
{
  // Le nom du bot à utiliser
  "bot": "smart_trade",

  // La pair à utiliser (par défaut, achete la base avec la quote - achette du BTC avec de l'USDT)
  "symbol": "BTCUSDT",

  // Pour le volume du trade, on peut indiquer le nb d'unité (unit),
  // ou un portion de l'ensemble du portefeuille sur la devise (size)
  // ou un volum total de 'quote' (nb d'unité ajusté par le market)
  //"unit": 1,      // nombre d'uniter à acheter
  //"size": "10%",  // taille par rapport à l'ensemble des quotes du portefeuille global
  "total": 20,      // Nombre de quote à utiliser (unité ajusté automatiquement)

  // Le mode d'achat peut êre au prix du marché,
  // a un cours limit à indiquer dans 'price'
  // ou après un signal de prix indiqué dans 'price', alors un achat est demandé à "order_price"
  "mode": "MARKET",       // "LIMIT", "MARKET", "COND_LIMIT_ORDER", "COND_MARKET_ORDER"
  // "price": 34100,       // si mode != "MARKET"
  // "order_price": 1000   // Si mode=="COND_LIMIT_ORDER"

  // Il est possible d'apprendre du cours, pour acheter moin chère
  // si le cours remonte de 'training_buy'. Mais on suit la chute
  "training": "0.05%", // "+3%" TODO ou "-3%" si le prix maximum d'achat est à la limite

  // Il est possible d'indiquer simultanément des règles de take profit (TP).
  "take_profit": {
    // Le signal d'activation est sur une 'base' au prix du marché ou sur une limite
    "base": "last",     // La base de déclanchement : *bid*, ask, last (securisé via pre-ordre)
    "mode": "MARKET",   // "MARKET" ou "LIMIT"

    "mode_sell": "LIMIT", // *"MARKET"* ou "LIMIT". Lorsque vend pour un TP, ordre au MARKET ou limit sur le trigger ?
    "sell_timeout": 5,  // Délais accordé pour un ordre limite, sinon, repasse en MARKET

    // La cible du profit en valeur ou % (TODO: negatif ?)
    // 100.0: déclenche à 100.0 quote
    // "+3%": déclenche au prix d'achat+3% (doit etre positif)
    "price": "0.02%",

    // "+3%": déclenche à la cible+3%, et vend si descend sous la cible (ne peut inf. à la cible hors market)
    // "-3%": déclenche à la cible, et vend si descend à la cible-3%
    "trailing": "-0.05%",

    // Take profit minimum, si le cours remonte pendant 'timeout', alors le SL est à ce niveau
    "minimal" : "0.01%",
    // Suit le prix montant pour ajuster le Min-TP ? (Risque de vendre plus rapidement, avant d'arriver au TP
    // cela peut etre compensé par une durée plus longue, pour s'assurer de la montée
    "trailing_minimal": false,

    "timeout": 2,  // En seconde, combien de temps la hausse doit être valide pour le trailing minimal
  },

  // Il est possible d'indiquer simultanément des règles de stop loss.
  "stop_loss": {
    // Le signal d'activation est sur une 'base' (ask préconisé)
    "base": "last",   // bid, *ask* , last (securisé via pre-ordre)

    // "MARKET": vend au marché
    // "COND_LIMIT_ORDER" : attend une condition pour vendre à la limite
    "mode": "MARKET",

    "mode_sell": "LIMIT", // *"MARKET"* ou "LIMIT". Lorsque vend pour un SL, ordre au MARKET ou limit sur le trigger ?
    "sell_timeout": 5,  // Délais accordé pour un ordre limite, sinon, repasse en MARKET

    // Le declenchement du prix en valeur ou %
    // 100.0: vend à 100.0
    // "-3%" : Vend sous le prix d'achat-3% (doit être négatif)
    // Si mode == "COND_LIMIT_ORDER", utilse "price" comme signal de dépot d'ordre
    "price": "-0.05%",

    // Si mode == "COND_LIMIT_ORDER", prix à ajouter au carnet d'ordre
    // "order_price": 100.0,

    // Le signal d'une baisse peut etre confirmé pendant un certain délai en seconde.
    // Le signal ne doit pas remonter pendant ce temps
    "timeout": 2,

    // Il es possible d'apprendre de la baisse pour remontrer progressivement le SL
    // au fur et à mesure de la monté du cours.
    // Le rapport achat/stop lost reste constant.
    "trailing": true,
  }
}

// TODO:
// - Ajouter les Take profits multiple
// - Gérer les "COND_LIMIT_ORDER", "COND_MARKET_ORDER"
// - Ajouter un calcul de la volatilité, pour activer ou non, automatiquement le trailing TP ou SL
// - Ajouter les ordres "inverse", pour inverser les devices. Vendre avant d'acheter.
//   C'est util pour la vente à découvert, ou pour traider BTC/ETH par exemple.
// - Rendre compatible avec les futures avec effet de levier
// - Trailing fini en Market ou en Limit ?